Процедура ПечатьАктОбОказанииУслуг(ТабДок, ДокументСсылка, ВыводитьЦену = Истина) Экспорт
	
	Макет = Документы.АктОбОказанииУслуг.ПолучитьМакет("ПФ_MXL_АктОбОказанииУслуг");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблПокупатель = Макет.ПолучитьОбласть("Покупатель");
	ОблПоставщик = Макет.ПолучитьОбласть("Поставщик");
	ОблШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблИтого = Макет.ПолучитьОбласть("Итого");
	ОблСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОблПодписи = Макет.ПолучитьОбласть("Подписи");
	ОблНомерСтроки = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОблКолонкаКодов = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОблДанные = Макет.ПолучитьОбласть("Строка|Данные");
	ОблДанные2 = Макет.ПолучитьОбласть("Строка|Данные2");
	ОблШапкаНомерСтроки = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОблШапкаКолонкаКодов = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОблШапкаДанные = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОблШапкаДанные2 = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные2");
	
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	АктОбОказанииУслуг.Номер КАК Номер,
	|	АктОбОказанииУслуг.Дата КАК Дата,
	|	АктОбОказанииУслуг.Контрагент КАК Контрагент,
	|	АктОбОказанииУслуг.Договор КАК Договор,
	|	АктОбОказанииУслуг.Организация КАК Организация,
	|	АктОбОказанииУслуг.Организация.НаименованиеПолное КАК НаименованиеПолное,
	|	АктОбОказанииУслуг.Организация.ИНН КАК ОрганизацияИНН,
	|	АктОбОказанииУслуг.Организация.ЮрАдрес КАК ОрганизацияЮридическийАдрес,
	|	АктОбОказанииУслуг.Организация.Телефоны КАК ОрганизацияТелефоны
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
	|ГДЕ
	|	АктОбОказанииУслуг.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = ЗапросШапка.Выполнить();
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	ВыборкаШапка.Следующий();
	
	ОблЗаголовок.Параметры.ТекстЗаголовка = "Накладная №" + ВыборкаШапка.Номер + " от " + 
	Формат(ВыборкаШапка.Дата, "ДЛФ=DD");
	ОблПокупатель.Параметры.ПредставлениеПолучателя = ВыборкаШапка.НаименованиеПолное + "Инн " + ВыборкаШапка.ОрганизацияИНН + " Адрес " + 
	ВыборкаШапка.ОрганизацияЮридическийАдрес + " Телефон " + ВыборкаШапка.ОрганизацияТелефоны;
	ОблПоставщик.Параметры.ПредставлениеПоставщика = ВыборкаШапка.Контрагент;
	
	
	ТабДок.Вывести(ОблЗаголовок);
	ТабДок.Вывести(ОблПокупатель);
	ТабДок.Вывести(ОблПоставщик);
	ТабДок.Вывести(ОблШапкаНомерСтроки);
	ТабДок.Присоединить(ОблШапкаДанные);
	Если ВыводитьЦену Тогда
		ТабДок.Присоединить(ОблШапкаКолонкаКодов);		
	КонецЕсли;
	
	ТабДок.Присоединить(ОблШапкаДанные2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктОбОказанииУслугРаботыИУслуги.Количество КАК Количество,
	|	АктОбОказанииУслугРаботыИУслуги.Цена КАК Цена,
	|	АктОбОказанииУслугРаботыИУслуги.Сумма КАК Сумма,
	|	АктОбОказанииУслугРаботыИУслуги.НомерСтроки КАК НомерСтроки,
	|	АктОбОказанииУслугРаботыИУслуги.Номенклатура.ЕдиницаИзмерения КАК Единица,
	|	АктОбОказанииУслугРаботыИУслуги.ПроцентСкидки КАК Скидка,
	|	АктОбОказанииУслугРаботыИУслуги.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.АктОбОказанииУслуг.РаботыИУслуги КАК АктОбОказанииУслугРаботыИУслуги
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписиИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДетальныеЗаписиИтоги.Следующий();
	ВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписиИтоги.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОблНомерСтроки.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОблНомерСтроки);
		ОблДанные.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Присоединить(ОблДанные);
		Если ВыводитьЦену Тогда
			ОблКолонкаКодов.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Присоединить(ОблКолонкаКодов);
		КонецЕсли;
		ОблДанные2.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Присоединить(ОблДанные2);
	КонецЦикла;
	
	ОблИтого.Параметры.Заполнить(ВыборкаДетальныеЗаписиИтоги);
	ТабДок.Вывести(ОблИтого);
	
	
	ОблСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(ВыборкаДетальныеЗаписиИтоги.Сумма,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ТабДок.Вывести(ОблСуммаПрописью);
	
	ТабДок.Вывести(ОблПодписи);
	
	
КонецПроцедуры