
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Сотрудник.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьПоРодителюСтатьи()
	
	Если ЗначениеЗаполнено(Объект.СтатьяДДС) 
		И Объект.СтатьяДДС.Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка() Тогда
		
		Если Объект.СтатьяДДС.Родитель.Наименование = "ДвижениеПоКонтрагенту" Тогда
			Элементы.Контрагент.Видимость = Истина;
		Иначе
			Элементы.Сотрудник.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Сотрудник.Видимость = Ложь;
	
	ОпределитьВидимостьПоРодителюСтатьи();
	
КонецПроцедуры

&НаСервере
Функция СтатьяДДСОбработкаВыбораНаСервере()
	
	Если Объект.СтатьяДДС.Наименование = "Оплата от покупателей" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		|			,
		|			Контрагент = &Контрагент
		|				И Организация = &Организация) КАК ВзаиморасчетыСПокупателямиОстатки";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаДокументаПоступлениеДС = Выборка.СуммаОстаток;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаДокументаПоступлениеДС;	
	
КонецФункции
&НаКлиенте
Процедура СтатьяДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СуммаДокумента = СтатьяДДСОбработкаВыбораНаСервере();
КонецПроцедуры
