
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Сотрудники
	Движения.Сотрудники.Записывать = Истина;
	Движение = Движения.Сотрудники.Добавить();
	Движение.Период = ДатаУвольнения;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	
	//Регистр Плановые Начисления
	Движения.ПлановыеНачисления.Записывать = Истина;
	Движение = Движения.ПлановыеНачисления.Добавить();
	Движение.Период = ДатаУвольнения;
	Движение.Организация = Организация;
	Движение.Сотрудник = Сотрудник;
	Движение.Сумма = 0;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
КонецПроцедуры


