&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сотрудник.Видимость = Ложь;
	Элементы.Контрагент.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьПоРодителюСтатьи()
	
	Если ЗначениеЗаполнено(Объект.СтатьяДДС) 
		И Объект.СтатьяДДС.Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка() Тогда
		
		Если Объект.СтатьяДДС.Родитель.Наименование = "ДвижениеПоКонтрагенту" Тогда
			Элементы.Контрагент.Видимость = Истина;
		Иначе
			Элементы.Сотрудник.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуДокумента()
	
	Если Объект.СтатьяДДС.Наименование = "Оплата поставщикам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
		               |	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		               |	ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки КАК ВзаиморасчетыСПоставщикамиОстатки
		               |ГДЕ
		               |	ВзаиморасчетыСПоставщикамиОстатки.Контрагент = &Контрагент
		               |	И ВзаиморасчетыСПоставщикамиОстатки.Организация = &Организация
		               |	И ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток >= 0";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаДокумента = Выборка.СуммаОстаток;
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Сотрудник.Видимость = Ложь;
	
	ОпределитьВидимостьПоРодителюСтатьи();
	
	Сумма = ПолучитьСуммуДокумента();

КонецПроцедуры

&НаСервере
Функция СтатьяДДСОбработкаВыбораНаСервере()
	
	Если Объект.СтатьяДДС.Наименование = "Оплата поставщикам" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСПоставщикамиОстатки.Организация КАК Организация,
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПоставщиками.Остатки КАК ВзаиморасчетыСПоставщикамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПоставщикамиОстатки.Контрагент = &Контрагент
		|	И ВзаиморасчетыСПоставщикамиОстатки.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаДокументаСписаниеДС = Выборка.СуммаОстаток;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаДокументаСписаниеДС;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СуммаДокумента = СтатьяДДСОбработкаВыбораНаСервере();
КонецПроцедуры



