
&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкуНаСервере()

	Док = Документы.КорректировкаОстатковНоменклатуры.СоздатьДокумент();
	Док.Дата = Объект.Дата;
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		Разница = Стр.Количество - Стр.КоличествоОстаток;
		
		Если Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Док.Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Объект.Дата;
		Движение.ВидДвижения = ?(Разница>0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Организация = Объект.Организация;
		Движение.Склад = Объект.Склад;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Количество = Разница * ?(Разница<0, -1, 1);
		Движение.Сумма = Стр.СуммаОстаток / Стр.КоличествоОстаток * Разница * ?(Разница<0, -1, 1);
	КонецЦикла;
	
	Док.Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Док.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировку(Команда)
	СоздатьКорректировкуНаСервере();
КонецПроцедуры
