&НаКлиенте
Процедура РаботыИУслугиКоличествоПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.РаботыИУслуги.ТекущиеДанные;
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура РаботыИУслугиЦенаПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.РаботыИУслуги.ТекущиеДанные;
	Если ТекущаяСтрока.ПроцентСкидки <> 0 И НЕ ТекущаяСтрока.ПроцентСкидки = null Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Цена - (ТекущаяСтрока.Цена/100*ТекущаяСтрока.ПроцентСкидки);
	КонецЕсли;
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура РаботыИУслугиПроцентСкидкиПриИзменении(Элемент)
    ТекущаяСтрока = Элементы.РаботыИУслуги.ТекущиеДанные;
    ТекущаяСтрока.Цена = ТекущаяСтрока.Цена - (ТекущаяСтрока.Цена/100*ТекущаяСтрока.ПроцентСкидки);
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры





