
&НаКлиенте
Процедура ВидыЦенПриАктивизацииСтроки(Элемент)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
		Элементы.Номенклатура.ОтборСтрок = Отбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		СтрокаТЧ.КлючСвязи = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	Элементы.Номенклатура.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	СтрокаТЧНом = Элементы.Номенклатура.ТекущиеДанные;
	Если НоваяСтрока Тогда
		СтрокаТЧНом.КлючСвязи = СтрокаТЧ.КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенПередУдалением(Элемент, Отказ)
	
	СтрокаТЧ = Элементы.ВидыЦен.ТекущиеДанные;
	
	Отбор = Новый Структура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	МассивСтрок = Объект.Номенклатура.НайтиСтроки(Отбор);
	
	Для Каждого Элемент Из МассивСтрок Цикл
		Объект.Номенклатура.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	А = 1;
КонецПроцедуры




