
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Начисления
	//Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ПериодДействияКонец);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ПериодДействияНачало;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ПериодДействияКонец);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Организация = Организация;
		Движение.Размер = ТекСтрокаНачисления.Размер;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
	КонецЦикла;         
	
	Движения.Начисления.Записать(, Ложь);
	
	//Расчет первичные
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Начисления.Размер КАК Размер,
	|	ЕСТЬNULL(НачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	|	ЕСТЬNULL(НачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.ДанныеГрафика(
	|				Регистратор = &Ссылка
	|					И ВидРасчета.КатегорияРасчета = &КатегорияРасчета) КАК НачисленияДанныеГрафика
	|		ПО Начисления.НомерСтроки = НачисленияДанныеГрафика.НомерСтроки
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|	И Начисления.ВидРасчета.КатегорияРасчета = &КатегорияРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КатегорияРасчета", Перечисления.КатегорииРасчетов.Первичное);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособРасчета = Перечисления.СпособыРасчета.ФиксСуммой Тогда
			Результат = Выборка.Размер;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.ПропорциональноОтработанномуВремени Тогда
			Если Выборка.План <> 0 Тогда
				Результат = Выборка.Размер / Выборка.План * Выборка.Факт;
			Иначе
				Результат = 0;	
			КонецЕсли;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.Процентом Тогда
			//доделать
		КонецЕсли;
		
		ЗаписьРегистра = Движения.Начисления[Выборка.НомерСтроки - 1];
		ЗаписьРегистра.Результат = Результат;
		
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	
	//Категория ЗависимоеПервогоУровня
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Начисления.Размер КАК Размер,
	|	ЕСТЬNULL(НачисленияБазаНачисления.РезультатБаза, 0) КАК База
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.БазаНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Ссылка
	|					И ВидРасчета.КатегорияРасчета = &КатегорияРасчета) КАК НачисленияБазаНачисления
	|		ПО Начисления.НомерСтроки = НачисленияБазаНачисления.НомерСтроки
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|	И Начисления.ВидРасчета.КатегорияРасчета = &КатегорияРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КатегорияРасчета", Перечисления.КатегорииРасчетов.ЗависимоеПервогоУровня);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Измерения = Новый Массив;
	Измерения.Добавить("Организация");
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособРасчета = Перечисления.СпособыРасчета.ФиксСуммой Тогда
			//Результат = Выборка.Размер;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.ПропорциональноОтработанномуВремени Тогда
			//Если Выборка.План <> 0 Тогда
			//	Результат = Выборка.Размер / Выборка.План * Выборка.Факт;
			//Иначе
			//	Результат = 0;
			//	
			//КонецЕсли;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.Процентом Тогда
			Результат = Выборка.База * Выборка.Размер / 100;
		КонецЕсли;
		
		ЗаписьРегистра = Движения.Начисления[Выборка.НомерСтроки - 1];
		ЗаписьРегистра.Результат = Результат;
		
		
	КонецЦикла;
	
	Движения.Начисления.Записать(); 
		
	//Завис 2го уровня
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Начисления.Размер КАК Размер,
	|	ЕСТЬNULL(НачисленияБазаНачисления.РезультатБаза, 0) КАК База
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления.БазаНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Ссылка
	|					И ВидРасчета.КатегорияРасчета = &КатегорияРасчета) КАК НачисленияБазаНачисления
	|		ПО Начисления.НомерСтроки = НачисленияБазаНачисления.НомерСтроки
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|	И Начисления.ВидРасчета.КатегорияРасчета = &КатегорияРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КатегорияРасчета", Перечисления.КатегорииРасчетов.ЗависимоеВторогоУровня);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособРасчета = Перечисления.СпособыРасчета.ФиксированнойСуммой Тогда
			Результат = Выборка.Размер;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.ПропорциональноОтработанномуВремени Тогда
			Результат = 0;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.Процентом Тогда
			Результат = Выборка.База * Выборка.Размер / 100;
		КонецЕсли;
		
		ЗаписьРегистра = Движения.Начисления[Выборка.НомерСтроки - 1];
		ЗаписьРегистра.Результат = Результат;
		
	КонецЦикла;
	
	
	//Регистр удержания 
	
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаУдержания.ПериодДействияНачало;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаУдержания.ПериодДействияКонец);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = ТекСтрокаУдержания.ПериодДействияНачало;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаУдержания.ПериодДействияКонец);
		Движение.Сотрудник = ТекСтрокаУдержания.Сотрудник;
		Движение.Организация = Организация;
		Движение.Размер = ТекСтрокаУдержания.Размер;
	КонецЦикла;
	
	Движения.Удержания.Записать(, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Удержания.НомерСтроки КАК НомерСтроки,
	|	Удержания.ВидРасчета КАК ВидРасчета,
	|	Удержания.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Удержания.Размер КАК Размер,
	|	ЕСТЬNULL(УдержанияБазаНачисления.РезультатБаза, 0) КАК База
	|ИЗ
	|	РегистрРасчета.Удержания КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания.БазаНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК УдержанияБазаНачисления
	|		ПО Удержания.НомерСтроки = УдержанияБазаНачисления.НомерСтроки
	|ГДЕ
	|	Удержания.Регистратор = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособРасчета = Перечисления.СпособыРасчета.ФиксСуммой Тогда
			Результат = Выборка.Размер;
		ИначеЕсли Выборка.СпособРасчета = Перечисления.СпособыРасчета.Процентом Тогда
			Результат = Выборка.База * Выборка.Размер / 100;
		Иначе
			Результат = 0;
		КонецЕсли;
		
		ЗаписьРегистра = Движения.Удержания[Выборка.НомерСтроки - 1];
		ЗаписьРегистра.Результат = Результат;
		
	КонецЦикла;
	
	Движения.Удержания.Записать();
	
КонецПроцедуры
