
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиСрезПоследних.Подразделение КАК Подразделение,
	               |	СотрудникиСрезПоследних.Должность КАК Должность
	               |ИЗ
	               |	РегистрСведений.Сотрудники.СрезПоследних(, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетЗаписи.Следующий() Тогда
		Подразделение = ВыборкаДетЗаписи.Подразделение;
		Должность = ВыборкаДетЗаписи.Должность;
	КонецЕсли;
	
КонецПроцедуры
