Функция Печать(Ссылка) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет("УстановкаЦен");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Номер = Ссылка.Номер;
	ОбластьЗаголовок.Параметры.Дата = Ссылка.Дата;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены КАК ВидЦены,
		|	УстановкаЦенНоменклатурыНоменклатура.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыНоменклатура.Цена КАК Цена
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатурыВидыЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры.Номенклатура КАК УстановкаЦенНоменклатурыНоменклатура
		|		ПО УстановкаЦенНоменклатурыВидыЦен.КлючСвязи = УстановкаЦенНоменклатурыНоменклатура.КлючСвязи
		|ГДЕ
		|	УстановкаЦенНоменклатурыВидыЦен.Ссылка = &Ссылка
		|	И УстановкаЦенНоменклатурыНоменклатура.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Цена)
		|ПО
		|	ВидЦены,
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьНачало = Макет.ПолучитьОбласть("Шапка|Номенклатура");
	ОбластьВидЦены = Макет.ПолучитьОбласть("Шапка|ВидЦены");
	
	ТабДок.Вывести(ОбластьНачало);
	
	ВыборкаВидЦены = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидЦены.Следующий() Цикл
		ОбластьВидЦены.Параметры.Заполнить(ВыборкаВидЦены);
		ТабДок.Присоединить(ОбластьВидЦены);
	КонецЦикла;
	
	ОбластьНачало = Макет.ПолучитьОбласть("Строка|Номенклатура");
	ОбластьВидЦены = Макет.ПолучитьОбласть("Строка|ВидЦены");
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ОбластьНачало.Параметры.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ТабДок.Вывести(ОбластьНачало);
		ВыборкаВидЦены = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидЦены", "ВСЕ");
		
		Пока ВыборкаВидЦены.Следующий() Цикл
			ОбластьВидЦены.Параметры.Заполнить(ВыборкаВидЦены);
			ТабДок.Присоединить(ОбластьВидЦены);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции