
&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.Начисления.ТекущиеДанные;
	СтрокаТЧСотрудники = Элементы.Сотрудники.ТекущиеДанные;
	Если НоваяСтрока Тогда
		СтрокаТЧСотрудники.КлючСвязи = СтрокаТЧ.КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриАктивизацииСтроки(Элемент)
	
	СтрокаТЧ = Элементы.Начисления.ТекущиеДанные;
	
	Если СтрокаТЧ <> Неопределено Тогда
		Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
		Элементы.Сотрудники.ОтборСтрок = Отбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТЧ = Элементы.Начисления.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		СтрокаТЧ.КлючСвязи = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Отбор = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	Элементы.Сотрудники.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПередУдалением(Элемент, Отказ)
	
	СтрокаТЧ = Элементы.Начисления.ТекущиеДанные;
	
	Отбор = Новый Структура("КлючСвязи", СтрокаТЧ.КлючСвязи);
	МассивСтрок = Объект.Сотрудники.НайтиСтроки(Отбор);
	
	Для Каждого Элемент Из МассивСтрок Цикл
		Объект.Сотрудники.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры


