
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    ПересчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    ПересчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    ПересчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    ПересчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммы(Элемент)
	СтрокаТЧ = Элементы[Элемент.Родитель.Имя].ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

