
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДвиженияДенежныхСредств 
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СтатьяДДС = СтатьяДДС;
	Движение.Аналитики = ?(СтатьяДДС.Родитель.Код = "000000007",Контрагент, Сотрудник);     
	Движение.СуммаПриход = СуммаДокумента;
	Движение.СуммаРасход = 0;
	
	//регистр ДенежныеСредства
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.БанковскийСчет = БанковскийСчет;
	Движение.Сумма = СуммаДокумента;
	
	//регистр ВзаиморасчетыСПокупателями	
	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСПокупателями.Добавить(); 
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = СуммаДокумента;
	
	//Бух учет
	Движения.Основной.Записывать = Истина;
	
	ДвижениеБух = Движения.Основной.Добавить();
	
	ДвижениеБух.Период = Дата;
	ДвижениеБух.Организация = Организация;
	ДвижениеБух.Сумма = СуммаДокумента;
	ДвижениеБух.СчетДт = ПланыСчетов.Основной.РасчетныеСчета;
	БухгалтерскийУчет.УстановитьСубконто(ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, "БанковскиеСчета", БанковскийСчет);
	
	Если СтатьяДДС.Родитель.Код = "000000007" Тогда
		ДвижениеБух.СчетКт = Счет;
		БухгалтерскийУчет.УстановитьСубконто(ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, "Контрагенты", Контрагент);
	Иначе
		ДвижениеБух.СчетКт = Счет;
		БухгалтерскийУчет.УстановитьСубконто(ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, "Сотрудники", Сотрудник);
	КонецЕсли; 
	
	
	
КонецПроцедуры



