Функция ПечатьПриемНаРаботу(Ссылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("ПриемНаРаботу");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Наименование = Ссылка.Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.Номер = Ссылка.Номер;
	ОбластьЗаголовок.Параметры.Дата = Ссылка.Дата;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемНаРаботуНачисления.ВидНачисления КАК ВидНачисления,
	               |	ПриемНаРаботуСотрудники.Сотрудник КАК Сотрудник,
	               |	ПриемНаРаботуСотрудники.Подразделение КАК Подразделение,
	               |	ПриемНаРаботуСотрудники.Должность КАК Должность,
	               |	ПриемНаРаботуНачисления.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПриемНаРаботу.Начисления КАК ПриемНаРаботуНачисления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	               |		ПО ПриемНаРаботуНачисления.КлючСвязи = ПриемНаРаботуСотрудники.КлючСвязи
	               |ГДЕ
	               |	ПриемНаРаботуНачисления.Ссылка = &Ссылка
	               |	И ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма)
	               |ПО
	               |	ВидНачисления,
	               |	Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаВидНачисления = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьИнформация = Макет.ПолучитьОбласть("Шапка|Информация");
	ТабДок.Вывести(ОбластьИнформация);
	
	ОбластьВидНачисления = Макет.ПолучитьОбласть("Шапка|ВидНачисления");
	ОбластьПодпись = Макет.ПолучитьОбласть("Шапка|Подпись");
	
	Пока ВыборкаВидНачисления.Следующий() Цикл
		
		ОбластьВидНачисления.Параметры.ВидНачисления = ВыборкаВидНачисления.ВидНачисления;
		ТабДок.Присоединить(ОбластьВидНачисления);
		
	КонецЦикла;
	
	ТабДок.Присоединить(ОбластьПодпись);
	
	ОбластьИнформация = Макет.ПолучитьОбласть("Строка|Информация");
	ОбластьВидНачисления = Макет.ПолучитьОбласть("Строка|ВидНачисления");
	ОбластьПодпись = Макет.ПолучитьОбласть("Строка|Подпись");
	
	ВыборкаСотрудники = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		ОбластьИнформация.Параметры.Сотрудник = ВыборкаСотрудники.Сотрудник;
		ОбластьИнформация.Параметры.Подразделение = ВыборкаСотрудники.Подразделение;
		ОбластьИнформация.Параметры.Должность = ВыборкаСотрудники.Должность;
		ТабДок.Вывести(ОбластьИнформация);
		
		ВыборкаНачисление = ВыборкаСотрудники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНачисления", "ВСЕ");
		Пока ВыборкаНачисление.Следующий() Цикл
			ОбластьВидНачисления.Параметры.ВидНачисления = ВыборкаНачисление.Сумма;
			ТабДок.Присоединить(ОбластьВидНачисления);
		КонецЦикла;
		
		ТабДок.Присоединить(ОбластьПодпись);
		
	КонецЦикла;
	
	Возврат ТабДок;
		
КонецФункции