
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Сотрудники
	Движения.Сотрудники.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Сотрудники.Добавить();
		Движение.Период = ТекСтрокаСотрудники.ДатаПриема;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = ТекСтрокаСотрудники.Подразделение;
		Движение.Должность = ТекСтрокаСотрудники.Должность;
		//Движение.КлючСвязи = ТекСтрокаСотрудники.КлючСвязи;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемНаРаботуНачисления.ВидНачисления КАК ВидНачисления,
	               |	ПриемНаРаботуНачисления.Сумма КАК Сумма,
	               |	ПриемНаРаботуСотрудники.Сотрудник КАК Сотрудник,
	               |	ПриемНаРаботуСотрудники.Ссылка.Организация КАК Организация,
	               |	ПриемНаРаботуСотрудники.ДатаПриема КАК ДатаПриема
	               |ИЗ
	               |	Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Начисления КАК ПриемНаРаботуНачисления
	               |		ПО ПриемНаРаботуСотрудники.КлючСвязи = ПриемНаРаботуНачисления.КлючСвязи
	               |ГДЕ
	               |	ПриемНаРаботуНачисления.Ссылка = &Ссылка
	               |	И ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПоСотрудникам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	Движения.ПлановыеНачисления.Записывать = Истина;
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
		
		ВыборкаПоконкретномуСотруднику = ВыборкаПоСотрудникам.Выбрать();
		
		Пока ВыборкаПоконкретномуСотруднику.Следующий() Цикл
			
			ТекВыборка = ВыборкаПоконкретномуСотруднику;
			Движение = Движения.ПлановыеНачисления.Добавить();
			Движение.Организация = ТекВыборка.Организация;
			Движение.Сотрудник = ТекВыборка.Сотрудник;
			Движение.ВидНачисления = ТекВыборка.ВидНачисления;
			Движение.Сумма = ТекВыборка.Сумма;
			Движение.Период = ТекВыборка.ДатаПриема;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
КонецПроцедуры
