
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГрафикРаботы.Установить(Объект.ГрафикРаботы);
	
	НаборЗаписей.Прочитать();
	
	СуществующиеЗаписи = Новый Соответствие;
	Для каждого Запись Из НаборЗаписей Цикл
		СуществующиеЗаписи.Вставить(Запись.Дата, Запись);
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	
	ТекДата = Объект.Период.ДатаНачала;
	ДнейВНеделе = Объект.График.Количество(); 
	
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		
		НомерДня = (ТекДата - Объект.Период.ДатаНачала) / 86400 % ДнейВНеделе;
		
		Значение = Число(Объект.График[НомерДня].Значение);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Дата = ТекДата;
		НоваяЗапись.Значение = Значение;
		НоваяЗапись.ГрафикРаботы = Объект.ГрафикРаботы;
		
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
